#Задля того, щоб перевірити всі умови та не перезапускати програму кожен раз, було прийнято рішення зациклити код в нескінченний цикл
while True:
    print("Введіть свій вік та натисніть ENTER:")
    age = input()

#Якщо строка пуста, або складається не виключно із чисел, або введено 0 - поточна ітерація переривається та починається наступна
    if not age.isnumeric() or not age or age=="0":
       print("Невірно введено вік, спробуйте ще\n")
       continue
    else:
       age=int(age)

#На цьому етапі починається безпосередньо перевірка віку особи
    if age<7:
        print("Де твої батьки?\n")
    elif age < 16 and age!=11:
       print("Це фільм для дорослих!\n")
    elif str(age)[0] == str(age)[1]:
       print("Як цікаво!\n")
    elif age > 65:
        print("Покажіть пенсійне посвідчення!\n")
    else:
       print("А білетів вже немає!\n")
